import { expect, it } from "vitest";
import { useTest, yourFunction } from "composables/test";
import { FULL_TILE_SET } from "composables/calculation"

it("two plus two is four", () => {
  expect(2 + 2).toBe(4);
});

it("execute useTest()", ()=> {
  const result = yourFunction();
  expect(result).toEqual([1, 2, 3]);
})

it("check full tile", ()=>{
  const defineAllTile = [
    "萬1","萬1","萬1","萬1",
    "萬2","萬2","萬2","萬2",
    "萬3","萬3","萬3","萬3",
    "萬4","萬4","萬4","萬4",
    "萬5","萬5","萬5","萬5",
    "萬6","萬6","萬6","萬6",
    "萬7","萬7","萬7","萬7",
    "萬8","萬8","萬8","萬8",
    "萬9","萬9","萬9","萬9",
    "筒1","筒1","筒1","筒1",
    "筒2","筒2","筒2","筒2",
    "筒3","筒3","筒3","筒3",
    "筒4","筒4","筒4","筒4",
    "筒5","筒5","筒5","筒5",
    "筒6","筒6","筒6","筒6",
    "筒7","筒7","筒7","筒7",
    "筒8","筒8","筒8","筒8",
    "筒9","筒9","筒9","筒9",
    "索1","索1","索1","索1",
    "索2","索2","索2","索2",
    "索3","索3","索3","索3",
    "索4","索4","索4","索4",
    "索5","索5","索5","索5",
    "索6","索6","索6","索6",
    "索7","索7","索7","索7",
    "索8","索8","索8","索8",
    "索9","索9","索9","索9",
    "東1","東2","東3","東4",
    "南1","南2","南3","南4",
    "西1","西2","西3","西4",
    "北1","北2","北3","北4",
    "白1","白2","白3","白4",
    "發1","發2","發3","發4",
    "中1","中2","中3","中4"
  ];
  

  expect(FULL_TILE_SET.sort()).toEqual(defineAllTile.sort())
})
